import React from "react";
import "./styleHTP.css";

function HTP() {
  return (
    <div class="wrapper">
      <div class="pricing-table gprice-single">
        <div class="head">
          <h4 class="title">การดำเนินเกมแต่ละรอบ</h4>
        </div>
        <div class="content">
          <ul>
            <li>เงินในภูมิภาคของผู้เล่นแต่ละคนจะคิดดอกเบี้ย</li>

            <li>
              ต่อจากนั้น
              ผู้เล่นคนนั้นสามารถปรับปรุงแผนการก่อสร้างได้โดยมีเวลากำหนด
            </li>
            <li>หากผู้เล่นพอใจกับแผนการก่อสร้างที่มีอยู่แล้ว</li>
            <li>
              สามารถยืนยันแผนนั้นได้ซึ่งลูกทีมก่อสร้างจะเริ่มดำเนินการตามแผนจนจบ
              จากนั้นจะเป็นตาของผู้เล่นคนต่อไป{" "}
            </li>
          </ul>
        </div>
      </div>

      <div class="pricing-table gprice-single">
        <div class="head">
          <h4 class="title">ภาพรวมของเกม</h4>
        </div>
        <div class="content">
          <ul>
            <li>UPBEAT</li>
            <li>
              เป็นเกมที่ผู้เล่นสองคนขึ้นไปต้องพยายามยึดอาณาเขตทั้งหมดให้เป็นของตน
            </li>
            <li>อาณาเขตประกอบด้วยช่องหกเหลี่ยมขนาด m*n</li>
            <li>แต่ละผู้เล่นจะต้องวางแผนการก่อสร้างเมือง</li>
            <li>
              โดยเขียนสคริปต์เป็นชุดคำสั่งที่จะควบคุมลูกทีมก่อสร้างให้เคลื่อนที่จากจุดศูนย์กลางเพื่อขยายเมืองหรือปรับปรุงภูมิภาคที่มีอยู่แล้ว
            </li>
            <li>
              เกมจะจบลงก็ต่อเมื่อผู้เล่นเพียงคนเดียวครอบครองภูมิภาคภายในแผนที่
            </li>
          </ul>
          <div class="sign-up">
            <a href="/menu" class="btn bordered radius">
              MENU
            </a>
          </div>
        </div>
      </div>

      <div class="pricing-table gprice-single">
        <div class="head">
          <h4 class="title">การเริ่มเกม</h4>
        </div>
        <div class="content">
          <ul>
            <li>
              ผู้เล่นแต่ละคนจะได้รับงบประมาณเริ่มต้นและจุดศูนย์กลางซึ่งถูกสุ่มโดยเกม
            </li>

            <li>
              แต่ละภูมิภาคจะมีเงินฝากไว้ซึ่งสามารถเพิ่มดอกเบี้ยได้
              โดยในตอนเริ่มเกมแต่ละผู้เล่นจะมีเพียงภูมิภาคศูนย์กลางซึ่งจะมีเงินฝากเริ่มต้นไว้
            </li>
            <li>
              ผู้เล่นแต่ละคนจะมีเวลาจำกัดในการวางแผนการก่อสร้างเริ่มต้น
              หลังจากนั้นแต่ละคนจะได้เวลาสำหรับการแก้ไขแผนก่อสร้าง
            </li>
            <li>แต่ละผู้เล่นจะต้องวางแผนการก่อสร้างเมือง</li>
            <li>เมื่อถึงตาของผู้เล่นคนแรก เกมจะเริ่มต้นรอบของเกมนั้น</li>
          </ul>
          <div class="startup">
            <a href="/newGame" class="btn bordered radius">
              Start
            </a>
          </div>
        </div>
      </div>

      <div class="pricing-table gprice-single">
        <div class="head">
          <h4 class="title">คำสั่งพื้นฐานในเกม</h4>
        </div>
        <div class="content">
          <ul>
            <li>done: สิ้นสุดรอบ</li>

            <li> relocate: ย้ายศูนย์กลางเมือง (มีค่าใช้จ่าย) </li>
            <li>move: เคลื่อนที่หนึ่งช่องไปยังทิศทางที่กำหนด</li>
            <li>invest: เพิ่มเงินฝากในภูมิภาคปัจจุบัน (มีค่าใช้จ่าย)</li>
            <li>collect: ถอนเงินฝากจากภูมิภาคปัจจุบัน (มีค่าใช้จ่าย)</li>
            <li>shoot: ยิงโจมตีภูมิภาคของฝ่ายตรงข้าม (มีค่าใช้จ่าย)</li>
          </ul>
        </div>
      </div>
    </div>
  );
}

export default HTP;
